# AsCurve Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..AsCurve Method
Edge Class See Also
---
Returns a curve that corresponds to the edge's parametric orientation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve AsCurve()
```

Visual Basic
---
```text
Public Function AsCurve As Curve
```

Visual C++
---
```text
public:
Curve^ AsCurve()
```

# ### Return Value
It can be an Arc, Line, or HermiteSpline.
# See Also
Edge Class
Autodesk.Revit.DB Namespace